"modified" =  "modified";
"added" =  "added"; 
"removed" =  "removed";
"deleted" =  "deleted"; 
"unknown" =  "unknown"; 
"ignored" =  "ignored";
"clean" =  "clean";

"ERROR" = "ERROR";

"An error occurred while creating Mercurial repository!"="An error occurred while creating Mercurial repository!";
"The selected directory/file doesn't belongs to a valid Mercurial repository!"="The selected directory/file doesn't belongs to a valid Mercurial repository!";
"Repository created sucessfully!"="Repository created sucessfully!";
"Please select a directory/file on Finder!" = "Please select a directory/file on Finder!";
"Repository already exists!" = "Repository already exists!";